app/views/authors/_form.html.slim

      /in ul included table of messages
  = collection_check_boxes(:author, :book_ids, Book.all, :id, :name_with_initial) do |book|
---
SELECT "books".* FROM "books"