app/views/authors/index.html.slim

      td
        - author.books.each do |book|
---
SELECT "books".* FROM "books" INNER JOIN "authors_books" ON "books"."id" = "authors_books"."book_id" WHERE "authors_books"."author_id" = ?  [["author_id", 11]]