app/views/authors/show.html.slim

SELECT "books".* FROM "books" INNER JOIN "authors_books" ON "books"."id" = "authors_books"."book_id" WHERE "authors_books"."author_id" = ?  [["author_id", 12]]
---
    th edition
  - @author.books.each do |book|