app/views/books/_form.html.slim

    table class='table'
      = collection_check_boxes(:book, :author_ids, Author.all, :id, :name_with_initial) do |author|
---
SELECT "authors".* FROM "authors"