app/views/books/show.html.slim

      th colspan=2 Author
    - @book.authors.each do |a|
---
SELECT  "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  ORDER BY "authors"."id" DESC LIMIT 1  [["book_id", 17]]