app/controllers/authors_controller.rb

  def show
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO "authors" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-07-06 09:20:49.108347"], ["updated_at", "2015-07-06 09:20:49.108347"]]

  def edit
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @author = Author.find(params[:id])

    if @author.update(author_params)
---
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "Updated"], ["updated_at", "2015-07-06 13:47:16.891630"], ["id", 1]]

  def index
    @author = Author.all
---
SELECT "authors".* FROM "authors"