app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO "authors" ("name", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Daron"], ["surname", "Gerlach"], ["created_at", "2015-07-16 13:18:36.195688"], ["updated_at", "2015-07-16 13:18:36.195688"]]

  def update
    @author = Author.find(params[:id])

    if @author.update(author_params)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "authors" SET "name" = ?, "surname" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "John"], ["surname", "Spencer"], ["updated_at", "2015-07-16 13:18:36.291690"], ["id", 1]]

  def destroy
    @author = Author.find(params[:id])
    @author.books.each do |book|
      book.destroy if book.authors.count == 1
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT "books".* FROM "books" INNER JOIN "authors_books" ON "books"."id" = "authors_books"."book_id" WHERE "authors_books"."author_id" = ?  [["author_id", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
SELECT COUNT(*) FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]