app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 17]]
---
  def show
    @book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 17]]
---
  def edit
    @book = Book.find(params[:id])

UPDATE "books" SET "edition" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["edition", 9], ["updated_at", "2015-07-13 08:46:35.850024"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)