app/controllers/books_controller.rb

INSERT INTO "books" ("title", "edition", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Cool Book"], ["edition", 8], ["created_at", "2015-07-16 13:46:41.788864"], ["updated_at", "2015-07-16 13:46:41.788864"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "title" = ?, "edition" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Washing Machines tutorial"], ["edition", 1], ["updated_at", "2015-07-16 13:46:41.828720"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)